# Summary of Notebook
    Dataframe: 49677
    Exported as pickle
    Saved as:  products_cleaned.pkl
    Learned the price mode. Used price mode to fix items with erroneous prices
    Changed the price of milk from 99999 to 2.5
    Changed the price of cottage cheese from 149000 to 2.5
    price range now 1-25

# Summary of Previous Notebook
    Dataframe: 49693 rows
    Exported as pickle
    Saved as: products_ready_to_clean
    Changed datatype
        product_id = int32
    product_name is missing in 16 rows
    product_id range: 1 to 49688
    aisle_id range: 1 to 134
    department_id range: 1 to 21
        highest count in department_id: 11, 19 and 13
    prices: $1 to $99,999

In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import datetime as dt

In [2]:
#import pickle products dataframe
df_products = pd.read_pickle(r'C:\Users\Selena\Desktop\3-22 Instacart Basket Analysis\02 Data\Prepared Data\products_ready_to_clean.pkl')
path = r'C:\Users\Selena\Desktop\3-22 Instacart Basket Analysis'
df_products = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'products_ready_to_clean.pkl'))

In [3]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int32
 1   product_name   49677 non-null  category
 2   aisle_id       49693 non-null  int16
 3   department_id  49693 non-null  int16
 4   price          49693 non-null  float64
dtypes: category(1), float64(1), int16(2), int32(1)
memory usage: 1.3 MB

#imported with correct number of rows

In [4]:
#checking values
df_products.describe()

         product_id      aisle_id  department_id         price
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [5]:
#dropping rows with no product name
df_products = df_products.dropna()

In [6]:
#checking change
df_products.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49677 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49677 non-null  int32
 1   product_name   49677 non-null  category
 2   aisle_id       49677 non-null  int16
 3   department_id  49677 non-null  int16
 4   price          49677 non-null  float64
dtypes: category(1), float64(1), int16(2), int32(1)
memory usage: 1.7 MB

In [12]:
#seeing if I can figure out the high price
df_products.loc[df_products['price'] == 99999]

       product_id           product_name  aisle_id  department_id    price
33666       33664  2 % Reduced Fat  Milk        84             16  99999.0

In [14]:
#getting the mode for the column
df_products.mode()['price'][0]

2.5

In [15]:
#changing the 99999 price
df_products.at[33666,'price']=2.5

In [16]:
df_products.describe()

         product_id      aisle_id  department_id         price
count  49677.000000  49677.000000   49677.000000  49677.000000
mean   24850.194235     67.763110      11.728687      7.980230
std    14340.588602     38.316396       5.850651     66.948472
min        1.000000      1.000000       1.000000      1.000000
25%    12433.000000     35.000000       7.000000      4.100000
50%    24851.000000     69.000000      13.000000      7.100000
75%    37267.000000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  14900.000000

In [17]:
#seeing if I can figure out the high price
df_products.loc[df_products['price'] == 14900]

,product_id,product_name,aisle_id,department_id,price
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0

In [18]:
#changing the 14900 price
df_products.at[21554,'price']=2.5

In [19]:
df_products.describe()

         product_id      aisle_id  department_id         price
count  49677.000000  49677.000000   49677.000000  49677.000000
mean   24850.194235     67.763110      11.728687      7.680343
std    14340.588602     38.316396       5.850651      4.199331
min        1.000000      1.000000       1.000000      1.000000
25%    12433.000000     35.000000       7.000000      4.100000
50%    24851.000000     69.000000      13.000000      7.100000
75%    37267.000000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000     25.000000

In [20]:
#exporting the file as a pickle
df_products.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'products_cleaned.pkl'))